armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32G4xx/Keil.STM32G4xx_DFP.pdsc
        <memory id="IRAM1" start="0x20000000" size="0x00008000" init="0" default="1" />

        <!-- ################################### 128 KB ################################### -->
        <!-- *************************  Device 'STM32G431CB'  ***************************** -->
        <device Dname="STM32G431CBTx">
          <memory id="IROM1"                              start="0x08000000" size="0x00020000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_128.FLM" start="0x08000000" size="0x00020000"             default="1" />
          <feature type="QFP" n="48"/>
        </device>
        <device Dname="STM32G431CBUx">
          <memory id="IROM1"                              start="0x08000000" size="0x00020000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_128.FLM" start="0x08000000" size="0x00020000"             default="1" />
          <feature type="QFP" n="48"/>
        </device>
        <device Dname="STM32G431CBYx">
          <memory id="IROM1"                              start="0x08000000" size="0x00020000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_128.FLM" start="0x08000000" size="0x00020000"             default="1" />
          <feature type="CSP" n="49"/>
        </device>

        <!-- *************************  Device 'STM32G431KB'  ***************************** -->
        <device Dname="STM32G431KBTx">
          <memory id="IROM1"                              start="0x08000000" size="0x00020000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_128.FLM" start="0x08000000" size="0x00020000"             default="1" />
          <feature type="QFP" n="32"/>
        </device>
        <device Dname="STM32G431KBUx">
          <memory id="IROM1"                              start="0x08000000" size="0x00020000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_128.FLM" start="0x08000000" size="0x00020000"             default="1" />
          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32G431RB'  ***************************** -->
        <device Dname="STM32G431RBTx">
          <memory id="IROM1"                              start="0x08000000" size="0x00020000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_128.FLM" start="0x08000000" size="0x00020000"             default="1" />
          <feature type="QFP" n="64"/>
        </device>
        <device Dname="STM32G431RBIx">
          <memory id="IROM1"                              start="0x08000000" size="0x00020000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_128.FLM" start="0x08000000" size="0x00020000"             default="1" />
          <feature type="BGA" n="64"/>
        </device>

        <!-- *************************  Device 'STM32G431VB'  ***************************** -->
        <device Dname="STM32G431VBTx">
          <memory id="IROM1"                              start="0x08000000" size="0x00020000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_128.FLM" start="0x08000000" size="0x00020000"             default="1" />
          <feature type="QFP" n="100"/>
        </device>

        <!-- ################################### 64 KB ################################### -->
        <!-- *************************  Device 'STM32G431C8'  ***************************** -->
        <device Dname="STM32G431C8Tx">
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1" />
          <feature type="QFP" n="48"/>
        </device>
        <device Dname="STM32G431C8Ux">
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1" />
          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32G431K8'  ***************************** -->
        <device Dname="STM32G431K8Tx">
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1" />
          <feature type="QFP" n="32"/>
        </device>
        <device Dname="STM32G431K8Ux">
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1" />
          <feature type="QFP" n="32"/>
        </device>
        <!-- *************************  Device 'STM32G431M8'  ***************************** -->
        <device Dname="STM32G431M8Tx">
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1" />
          <feature type="QFP" n="80"/>
        </device>

        <!-- *************************  Device 'STM32G431R8'  ***************************** -->
        <device Dname="STM32G431R8Tx">
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1" />
          <feature type="QFP" n="64"/>
        </device>
        <device Dname="STM32G431R8Ix">
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1" />
          <feature type="BGA" n="64"/>
        </device>

