armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32G4xx/Keil.STM32G4xx_DFP.pdsc
        <!-- *************************  Device 'STM32G431V8'  ***************************** -->
        <device Dname="STM32G431V8Tx">
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1" />
          <feature type="QFP" n="100"/>
        </device>

        <!-- ################################### 32 KB ################################### -->
        <!-- *************************  Device 'STM32G431C6'  ***************************** -->
        <device Dname="STM32G431C6Tx">
          <memory id="IROM1"                              start="0x08000000" size="0x00008000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1" />
          <feature type="QFP" n="48"/>
        </device>
        <device Dname="STM32G431C6Ux">
          <memory id="IROM1"                              start="0x08000000" size="0x00008000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1" />
          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32G431K6'  ***************************** -->
        <device Dname="STM32G431K6Tx">
          <memory id="IROM1"                              start="0x08000000" size="0x00008000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1" />
          <feature type="QFP" n="32"/>
        </device>
        <device Dname="STM32G431K6Ux">
          <memory id="IROM1"                              start="0x08000000" size="0x00008000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1" />
          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32G431M6'  ***************************** -->
        <device Dname="STM32G431M6Tx">
          <memory id="IROM1"                              start="0x08000000" size="0x00008000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1" />
          <feature type="QFP" n="80"/>
        </device>

        <!-- *************************  Device 'STM32G431R6'  ***************************** -->
        <device Dname="STM32G431R6Tx">
          <memory id="IROM1"                              start="0x08000000" size="0x00008000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1" />
          <feature type="QFP" n="64"/>
        </device>
        <device Dname="STM32G431R6Ix">
          <memory id="IROM1"                              start="0x08000000" size="0x00008000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1" />
          <feature type="BGA" n="64"/>
        </device>

        <!-- *************************  Device 'STM32G431V6'  ***************************** -->
        <device Dname="STM32G431V6Tx">
          <memory id="IROM1"                              start="0x08000000" size="0x00008000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1" />
          <feature type="QFP" n="100"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32G441'  **************************** -->
      <subFamily DsubFamily="STM32G441">
        <processor Dclock="150000000" />
        <compile header="Drivers/CMSIS/Device/ST/STM32G4xx/Include/stm32g4xx.h" define="STM32G441xx"/>
        <debugvars configfile="CMSIS/Debug/STM32G4xx.dbgconf">
          __var DbgMCU_CR       = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz1 = 0x00000000;   // DGBMCU_APB1_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB1_Fz2 = 0x00000000;   // DGBMCU_APB1_FZ2: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz  = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin    = 0x00040002;   // PE2
          __var TraceD0_Pin     = 0x00040003;   // PE3
          __var TraceD1_Pin     = 0x00040004;   // PE4
          __var TraceD2_Pin     = 0x00040005;   // PE5
          __var TraceD3_Pin     = 0x00040006;   // PE6
        </debugvars>
        <debug svd="CMSIS/SVD/STM32G441xx.svd"/>

        <book name="Documentation/DocID031375.pdf" title="STM32G441xx Data Brief"/>

        <memory id="IRAM1" start="0x20000000" size="0x00008000" init="0" default="1" />

        <!-- ################################### 128 KB ################################### -->
        <!-- *************************  Device 'STM32G441CB'  ***************************** -->
        <device Dname="STM32G441CBTx">
          <memory id="IROM1"                              start="0x08000000" size="0x00020000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_128.FLM" start="0x08000000" size="0x00020000"             default="1" />
          <feature type="QFP" n="48"/>
        </device>
        <device Dname="STM32G441CBUx">
          <memory id="IROM1"                              start="0x08000000" size="0x00020000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_128.FLM" start="0x08000000" size="0x00020000"             default="1" />
          <feature type="QFP" n="48"/>
        </device>
        <device Dname="STM32G441CBYx">
          <memory id="IROM1"                              start="0x08000000" size="0x00020000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_128.FLM" start="0x08000000" size="0x00020000"             default="1" />
          <feature type="CSP" n="49"/>
        </device>

        <!-- *************************  Device 'STM32G441KB'  ***************************** -->
        <device Dname="STM32G441KBTx">
          <memory id="IROM1"                              start="0x08000000" size="0x00020000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_128.FLM" start="0x08000000" size="0x00020000"             default="1" />
          <feature type="QFP" n="32"/>
        </device>
        <device Dname="STM32G441KBUx">
          <memory id="IROM1"                              start="0x08000000" size="0x00020000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_128.FLM" start="0x08000000" size="0x00020000"             default="1" />
          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32G441RB'  ***************************** -->
        <device Dname="STM32G441RBTx">
          <memory id="IROM1"                              start="0x08000000" size="0x00020000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_128.FLM" start="0x08000000" size="0x00020000"             default="1" />
          <feature type="QFP" n="64"/>
        </device>
        <device Dname="STM32G441RBIx">
          <memory id="IROM1"                              start="0x08000000" size="0x00020000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_128.FLM" start="0x08000000" size="0x00020000"             default="1" />
          <feature type="BGA" n="64"/>
        </device>

