armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32G4xx/Keil.STM32G4xx_DFP.pdsc
        <!-- #################################### 512 KB ################################# -->
        <!-- *************************  Device 'STM32G484CE'  ***************************** -->
        <device Dname="STM32G484CETx">
          <memory id="IROM1"                                   start="0x08000000" size="0x00080000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_512_Dual.FLM" start="0x08000000" size="0x00080000"             default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_512.FLM"      start="0x08000000" size="0x00080000"             default="0" />
          <feature type="QFP" n="48"/>
        </device>
        <device Dname="STM32G484CEUx">
          <memory id="IROM1"                                   start="0x08000000" size="0x00080000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_512_Dual.FLM" start="0x08000000" size="0x00080000"             default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_512.FLM"      start="0x08000000" size="0x00080000"             default="0" />
          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32G484RE'  ***************************** -->
        <device Dname="STM32G484RETx">
          <memory id="IROM1"                                   start="0x08000000" size="0x00080000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_512_Dual.FLM" start="0x08000000" size="0x00080000"             default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_512.FLM"      start="0x08000000" size="0x00080000"             default="0" />
          <feature type="QFP" n="64"/>
        </device>

        <!-- *************************  Device 'STM32G484VE'  ***************************** -->
        <device Dname="STM32G484VETx">
          <memory id="IROM1"                                   start="0x08000000" size="0x00080000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_512_Dual.FLM" start="0x08000000" size="0x00080000"             default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_512.FLM"      start="0x08000000" size="0x00080000"             default="0" />
          <feature type="QFP" n="100"/>
        </device>
        <device Dname="STM32G484VEIx">
          <memory id="IROM1"                                   start="0x08000000" size="0x00080000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_512_Dual.FLM" start="0x08000000" size="0x00080000"             default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_512.FLM"      start="0x08000000" size="0x00080000"             default="0" />
          <feature type="BGA" n="100"/>
        </device>
        <device Dname="STM32G484VEHx">
          <memory id="IROM1"                                   start="0x08000000" size="0x00080000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_512_Dual.FLM" start="0x08000000" size="0x00080000"             default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_512.FLM"      start="0x08000000" size="0x00080000"             default="0" />
          <feature type="BGA" n="100"/>
        </device>

        <!-- *************************  Device 'STM32G484ME'  ***************************** -->
        <device Dname="STM32G484METx">
          <memory id="IROM1"                                   start="0x08000000" size="0x00080000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_512_Dual.FLM" start="0x08000000" size="0x00080000"             default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_512.FLM"      start="0x08000000" size="0x00080000"             default="0" />
          <feature type="QFP" n="80"/>
        </device>
        <device Dname="STM32G484MEYx">
          <memory id="IROM1"                                   start="0x08000000" size="0x00080000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_512_Dual.FLM" start="0x08000000" size="0x00080000"             default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_512.FLM"      start="0x08000000" size="0x00080000"             default="0" />
          <feature type="QFP" n="81"/>
        </device>

        <!-- *************************  Device 'STM32G484QE'  ***************************** -->
        <device Dname="STM32G484QETx">
          <memory id="IROM1"                                   start="0x08000000" size="0x00080000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_512_Dual.FLM" start="0x08000000" size="0x00080000"             default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_512.FLM"      start="0x08000000" size="0x00080000"             default="0" />
          <feature type="QFP" n="128"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32GBK1'  **************************** -->
      <subFamily DsubFamily="STM32GBK1">
        <compile header="Drivers/CMSIS/Device/ST/STM32G4xx/Include/stm32g4xx.h" define="STM32GBK1CB"/>
        <debugvars configfile="CMSIS/Debug/STM32G4xx.dbgconf">
          __var DbgMCU_CR       = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz1 = 0x00000000;   // DGBMCU_APB1_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB1_Fz2 = 0x00000000;   // DGBMCU_APB1_FZ2: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz  = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin    = 0x00040002;   // PE2
          __var TraceD0_Pin     = 0x00040003;   // PE3
          __var TraceD1_Pin     = 0x00040004;   // PE4
          __var TraceD2_Pin     = 0x00040005;   // PE5
          __var TraceD3_Pin     = 0x00040006;   // PE6
        </debugvars>
        <debug svd="CMSIS/SVD/STM32GBK1CBT6.svd"/>

        <book name="Documentation/DS12712.pdf" title="STM32G473xx Data Sheet"/>

