armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32G4xx/Keil.STM32G4xx_DFP.pdsc
        <memory id="IRAM1" start="0x20000000" size="0x00008000" init="0" default="1" />

        <!-- ################################### 128 KB ################################### -->
        <!-- *************************  Device 'STM32GBK1CB'  ***************************** -->
        <device Dname="STM32GBK1CB">
          <memory id="IROM1"                              start="0x08000000" size="0x00020000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32G4xx_128.FLM" start="0x08000000" size="0x00020000"             default="1" />
          <feature type="QFP" n="48"/>
        </device>
      </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="Compiler GCC">
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="Compiler IAR">
      <require Tcompiler="IAR"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="STM32G4">
      <description>STMicroelectronics STM32G4 Devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32G4*"/>
    </condition>

    <condition id="STM32G431">
      <description>STMicroelectronics STM32G431 Devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32G431*"/>
    </condition>
    <condition id="STM32G441">
      <description>STMicroelectronics STM32G441 Devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32G441*"/>
    </condition>
    <condition id="STM32G471">
      <description>STMicroelectronics STM32G471 Devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32G471*"/>
    </condition>
    <condition id="STM32G473">
      <description>STMicroelectronics STM32G473 Devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32G473*"/>
    </condition>
    <condition id="STM32G474">
      <description>STMicroelectronics STM32G474 Devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32G474*"/>
    </condition>
    <condition id="STM32G483">
      <description>STMicroelectronics STM32G483 Devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32G483*"/>
    </condition>
    <condition id="STM32G484">
      <description>STMicroelectronics STM32G484 Devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32G484*"/>
    </condition>
    <condition id="STM32GBK1">
      <description>STMicroelectronics STM32GBK1 Devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32GBK1*"/>
    </condition>

    <!-- Device + CMSIS + STM32CubeMX Conditions -->
    <condition id="STM32G4 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32G4 Devices, CMSIS-Core and STM32CubeMX</description>
      <require condition="STM32G4"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>

    <condition id="STM32G474 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32G474 Devices, CMSIS-Core and STM32CubeMX</description>
      <require condition="STM32G474"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>

    <!-- STM32G474E-EVAL BSP Conditions -->
    <condition id="STM32G474E-EVAL BSP">
      <description>STMicroelectronics STM32G474E-EVAL BSP</description>
      <require condition="STM32G474 CMSIS STM32CubeMX"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="I/O"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="BUS"/>
    </condition>
    <condition id="STM32G474E-EVAL BSP Audio">
      <description>STMicroelectronics STM32G474E-EVAL BSP Audio</description>
      <require condition="STM32G474 CMSIS STM32CubeMX"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32G474E-EVAL BSP BUS">
      <description>STMicroelectronics STM32G474E-EVAL BSP BUS</description>
      <require condition="STM32G474 CMSIS STM32CubeMX"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32G474E-EVAL BSP ENV-Sensor">
      <description>STMicroelectronics STM32G474E-EVAL BSP ENV-Sensor</description>
      <require condition="STM32G474 CMSIS STM32CubeMX"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32G474E-EVAL BSP IDD">
      <description>STMicroelectronics STM32G474E-EVAL BSP IDD</description>
      <require condition="STM32G474 CMSIS STM32CubeMX"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32G474E-EVAL BSP IO">
      <description>STMicroelectronics STM32G474E-EVAL BSP IO</description>
      <require condition="STM32G474 CMSIS STM32CubeMX"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32G474E-EVAL BSP LCD">
      <description>STMicroelectronics STM32G474E-EVAL BSP LCD</description>
      <require condition="STM32G474 CMSIS STM32CubeMX"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32G474E-EVAL BSP QSPI">
      <description>STMicroelectronics STM32L496G-Discovery BSP QSPI</description>
      <require condition="STM32G474 CMSIS STM32CubeMX"/>
    </condition>
    <condition id="STM32G474E-EVAL BSP SD">
      <description>STMicroelectronics STM32G474E-EVAL BSP SD</description>
      <require condition="STM32G474 CMSIS STM32CubeMX"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="I/O"/>
    </condition>
    <condition id="STM32G474E-EVAL BSP Smartcard">
      <description>STMicroelectronics STM32G474E-EVAL BSP Smartcard</description>
      <require condition="STM32G474 CMSIS STM32CubeMX"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="I/O"/>
    </condition>
    <condition id="STM32G474E-EVAL BSP SRAM">
      <description>STMicroelectronics STM32G474E-EVAL BSP SRAM</description>
      <require condition="STM32G474 CMSIS STM32CubeMX"/>
    </condition>
    <condition id="STM32G474E-EVAL BSP USBPD">
      <description>STMicroelectronics STM32G474E-EVAL BSP USBPD</description>
      <require condition="STM32G474 CMSIS STM32CubeMX"/>
    </condition>
    <condition id="STM32G474E-EVAL LED">
      <description>STMicroelectronics STM32G474E-EVAL LED</description>
      <require condition="STM32G474 CMSIS STM32CubeMX"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32G474E-EVAL Buttons">
      <description>STMicroelectronics STM32G474E-EVAL Buttons</description>
      <require condition="STM32G474 CMSIS STM32CubeMX"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
