armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32G4xx/Keil.STM32G4xx_DFP.pdsc
    <condition id="STM32G474E-EVAL Joystick">
      <description>STMicroelectronics STM32G474E-EVAL Joystick</description>
      <require condition="STM32G474 CMSIS STM32CubeMX"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32G474E-EVAL ADC">
      <description>STMicroelectronics STM32G474E-EVAL ADC</description>
      <require condition="STM32G474 CMSIS STM32CubeMX"/>
    </condition>
  </conditions>

  <generators>
    <!-- This generator is launched if any component referencing this generator by 'id' is selected and the specified <gpdsc> file does not exist -->
    <generator id="STM32CubeMX">
      <description>ST Microelectronics: STCubeMX Environment</description>
      <command>MDK/CubeMX/STM32CubeMxLauncher.exe</command> <!-- path is specified either absolute or relative to PDSC or GPDSC file -->
      <workingDir>$PRTE/Device</workingDir> <!-- path is specified either absolute or relative to PDSC or GPDSC file. If not specified it is the project directory configured by the environment -->
      <arguments>
        <!-- D = Device (Dname/Dvariant as configured by environment) -->
        <argument>$D</argument>
        <!-- Project path and project name (as configured by environment) -->
        <argument>#P</argument>
        <!-- absolute or relative to workingDir. $S = Device Family Pack base folder -->
        <argument>$S</argument>
      </arguments>
      <!-- path is either absolute or relative to working directory -->
      <gpdsc name="$PRTE/Device/$D/FrameworkCubeMX.gpdsc"/>
    </generator>
  </generators>

  <taxonomy>
    <description Cclass="Device" Cgroup="STM32Cube HAL">STM32G4xx Hardware Abstraction Layer (HAL) Drivers</description>
  </taxonomy>

  <apis>
    <api Cclass="Device" Cgroup="STM32Cube Framework" Capiversion="1.1.0" exclusive="1">
      <description>STM32Cube Framework</description>
      <files>
        <file category="doc" name="MDK/CubeMX/Documentation/index.html"/>
      </files>
    </api>
  </apis>

  <components>
    <bundle Cbundle="STM32CubeMX" Cclass="Device" isDefaultVariant="true" Cversion="1.0.0">
      <description>Peripheral, Clock and Pin configuration are managed by STM32CubeMX</description>
      <doc>MDK/CubeMX/Documentation/index.html</doc>
      <component Cgroup="Startup" Cversion="1.0.0" condition="STM32G4 CMSIS STM32CubeMX">  <!-- Cversion is necessary -->
        <description>System Startup for STMicroelectronics STM32G4 Series</description>
        <RTE_Components_h>
          <!-- the following content goes into file 'RTE_Components.h' -->
          #define RTE_DEVICE_STARTUP_STM32G4XX    /* Device Startup for STM32G4 */
        </RTE_Components_h>

        <files>
          <!-- Flash Option Bytes templates -->
          <!--file category="source"   name="MDK/Device/Source/ARM/STM32G4xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes"/-->
        </files>
      </component>

      <component generator="STM32CubeMX" Cgroup="STM32Cube Framework" Csub="STM32CubeMX" Cversion="1.0.0" condition="STM32G4">
        <description>Configuration via STM32CubeMX</description>
        <RTE_Components_h>
          #define RTE_DEVICE_FRAMEWORK_CUBE_MX
        </RTE_Components_h>
        <files>
          <file category="doc"     name="MDK/CubeMX/Documentation/cubemx.html"/>
          <file category="source"  name="MDK/CubeMX/run_STM32CubeMX.c"         version="1.0.0"/>
          <file category="other"   name="MDK/CubeMX/FrameworkCubeMX_gpdsc.ftl" version="1.0.0"/>
          <file category="other"   name="MDK/CubeMX/MX_Device_h.ftl"           version="1.0.2"/>
        </files>
      </component>

      <component Cgroup="STM32Cube HAL" Cversion="1.10.0" condition="STM32G4 CMSIS STM32CubeMX">
        <description>STM32Cube HAL Drivers</description>
        <RTE_Components_h>
          #define RTE_DEVICE_CUBE_MX_HAL
        </RTE_Components_h>
        <files>
          <file category="source"  name="MDK/Driver/stm32g4xx_ll.c"/>
          <file category="include" name="Drivers/STM32G4xx_HAL_Driver/Inc/"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_adc.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_adc_ex.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_comp.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_cordic.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_cortex.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_crc.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_crc_ex.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_cryp.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_cryp_ex.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_dac.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_dac_ex.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_dma.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_dma_ex.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_exti.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_fdcan.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_flash.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_flash_ex.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_flash_ramfunc.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_fmac.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_gpio.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_hrtim.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_i2c.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_i2c_ex.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_i2s.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_irda.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_iwdg.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_lptim.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_nand.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_nor.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_opamp.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_opamp_ex.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_pcd.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_pcd_ex.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_pwr.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_pwr_ex.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_qspi.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_rcc.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_rcc_ex.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_rng.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_rtc.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_rtc_ex.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_sai.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_sai_ex.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_smartcard.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_smartcard_ex.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_smbus.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_spi.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_spi_ex.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_sram.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_tim.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_tim_ex.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_uart.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_uart_ex.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_usart.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_usart_ex.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_hal_wwdg.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_ll_adc.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_ll_comp.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_ll_cordic.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_ll_crc.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_ll_crs.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_ll_dac.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_ll_dma.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_ll_exti.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_ll_fmac.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_ll_fmc.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_ll_gpio.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_ll_hrtim.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_ll_i2c.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_ll_lptim.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_ll_lpuart.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_ll_opamp.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_ll_pwr.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_ll_rcc.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_ll_rng.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_ll_rtc.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_ll_spi.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_ll_tim.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_ll_ucpd.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_ll_usart.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_ll_usb.c"/>
          <file category="source"  name="Drivers/STM32G4xx_HAL_Driver/Src/stm32g4xx_ll_utils.c"/>
        </files>
      </component>
    </bundle>

    <!-- CMSIS drivers -->


    <!-- STM32G474E-EVAL Board Support -->
    <bundle Cbundle="STM32G474E-EVAL" Cclass="Board Support" Cversion="1.0.0">
      <description>STMicroelectronics STM32G474E-EVAL Board</description>
      <!--doc>MDK/Boards/ST/STM32G474E-EVAL/Documentation/?.pdf</doc-->
      <doc></doc>
      <component Cgroup="Drivers" Csub="Basic I/O"          condition="STM32G474E-EVAL BSP">
        <description>LEDs, push-buttons and COM ports for STMicroelectronics STM32G474E-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval.h"/>
          <file category="source" name="Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval.c"/>
          <file category="header" name="MDK/Boards/ST/STM32G474E-EVAL/ConfigTemplate/stm32g474e_eval_conf.h" attr="config" version="1.0.0"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Audio"              condition="STM32G474E-EVAL BSP Audio">
        <description>Audio for STMicroelectronics STM32G474E-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_audio.h"/>
          <file category="source" name="Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_audio.c"/>
          <file category="source" name="Drivers/BSP/Components/wm8994/wm8994.c"/>
          <file category="source" name="Drivers/BSP/Components/wm8994/wm8994_reg.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="BUS"                condition="STM32G474E-EVAL BSP BUS">
        <description>BUS for STMicroelectronics STM32G474E-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_bus.h"/>
          <file category="source" name="Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_bus.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="ENV-Sensor"         condition="STM32G474E-EVAL BSP ENV-Sensor">
        <description>ENV-SensorD for STMicroelectronics STM32G474E-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_env_sensor.h"/>
          <file category="source" name="Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_env_sensor.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="IDD"                condition="STM32G474E-EVAL BSP IDD">
        <description>IDD for STMicroelectronics STM32G474E-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_idd.h"/>
          <file category="source" name="Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_idd.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="I/O"                condition="STM32G474E-EVAL BSP IO">
        <description>I/O for STMicroelectronics STM32G474E-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_io.h"/>
          <file category="source" name="Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_io.c"/>
          <file category="source" name="Drivers/BSP/Components/mfxstm32l152/mfxstm32l152.c"/>
          <file category="source" name="Drivers/BSP/Components/mfxstm32l152/mfxstm32l152_reg.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="LCD"                condition="STM32G474E-EVAL BSP LCD">
        <description>LCD for STMicroelectronics STM32G474E-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_lcd.h"/>
          <file category="source" name="Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval_lcd.c"/>
          <file category="source" name="Drivers/BSP/Components/hx8347d/hx8347d.c"/>
          <file category="source" name="Drivers/BSP/Components/hx8347d/hx8347d_regs.c"/>
        </files>
      </component>
